#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_lb_rule.privatedblbnatrule will be created
  + resource "azurerm_lb_rule" "privatedblbnatrule" {
      + backend_address_pool_id        = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/loadBalancers/db-lb/backendAddressPools/PrivateDBBackEndAddressPool"
      + backend_port                   = 5432
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "PrivateDBIPAddress"
      + frontend_port                  = 5432
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/loadBalancers/db-lb"
      + name                           = "postgrs"
      + probe_id                       = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/loadBalancers/db-lb/probes/db-running-probe"
      + protocol                       = "Tcp"
      + resource_group_name            = "devops-training-team1"
    }

  # module.vnet.azurerm_subnet.subnet[0] will be updated in-place
  ~ resource "azurerm_subnet" "subnet" {
        address_prefix                                 = "10.0.1.0/24"
        enforce_private_link_endpoint_network_policies = false
        enforce_private_link_service_network_policies  = false
        id                                             = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend"
        ip_configurations                              = [
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/vmscaleset/virtualMachines/0/networkInterfaces/publicNetworkProfile/ipConfigurations/PublicIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/vmscaleset/virtualMachines/2/networkInterfaces/publicNetworkProfile/ipConfigurations/PublicIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/vmscaleset/virtualMachines/3/networkInterfaces/publicNetworkProfile/ipConfigurations/PublicIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/loadBalancers/prlb-lb/frontendIPConfigurations/PrivateIPAddress",
        ]
        name                                           = "frontend"
      - network_security_group_id                      = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/ssh" -> null
        resource_group_name                            = "devops-training-team1"
        service_endpoints                              = []
        virtual_network_name                           = "acctvnet"
    }

  # module.vnet.azurerm_subnet.subnet[1] will be updated in-place
  ~ resource "azurerm_subnet" "subnet" {
        address_prefix                                 = "10.0.2.0/24"
        enforce_private_link_endpoint_network_policies = false
        enforce_private_link_service_network_policies  = false
        id                                             = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/backend"
        ip_configurations                              = [
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/privatescaleset/virtualMachines/0/networkInterfaces/privateNetworkProfile/ipConfigurations/PrivateIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/privatescaleset/virtualMachines/2/networkInterfaces/privateNetworkProfile/ipConfigurations/PrivateIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/privatescaleset/virtualMachines/3/networkInterfaces/privateNetworkProfile/ipConfigurations/PrivateIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/loadBalancers/db-lb/frontendIPConfigurations/PrivateDBIPAddress",
        ]
        name                                           = "backend"
      - network_security_group_id                      = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/ssh" -> null
        resource_group_name                            = "devops-training-team1"
        service_endpoints                              = []
        virtual_network_name                           = "acctvnet"
    }

  # module.vnet.azurerm_subnet.subnet[2] will be updated in-place
  ~ resource "azurerm_subnet" "subnet" {
        address_prefix                                 = "10.0.3.0/24"
        enforce_private_link_endpoint_network_policies = false
        enforce_private_link_service_network_policies  = false
        id                                             = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/database"
        ip_configurations                              = [
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/dbscaleset/virtualMachines/0/networkInterfaces/dbNetworkProfile/ipConfigurations/DBIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/dbscaleset/virtualMachines/1/networkInterfaces/dbNetworkProfile/ipConfigurations/DBIPConfiguration",
            "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Compute/virtualMachineScaleSets/dbscaleset/virtualMachines/2/networkInterfaces/dbNetworkProfile/ipConfigurations/DBIPConfiguration",
        ]
        name                                           = "database"
      - network_security_group_id                      = "/subscriptions/f18e2af9-2f65-4e18-bc39-54d74e271e7c/resourceGroups/devops-training-team1/providers/Microsoft.Network/networkSecurityGroups/ssh" -> null
        resource_group_name                            = "devops-training-team1"
        service_endpoints                              = []
        virtual_network_name                           = "acctvnet"
    }

Plan: 1 to add, 3 to change, 0 to destroy.

Warning: "network_security_group_id": [DEPRECATED] Use the `azurerm_subnet_network_security_group_association` resource instead.

  on main.tf line 14, in resource "azurerm_subnet" "frontend":
  14: resource "azurerm_subnet" "frontend" {

(and 3 more similar warnings elsewhere)


Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/vnet/Azure-terraform-azurerm-vnet-e0b9155/main.tf line 3, in resource "azurerm_resource_group" "vnet":
   3:   name     = "${var.resource_group_name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 12 more similar warnings elsewhere)


Warning: Quoted type constraints are deprecated

  on .terraform/modules/vnet/Azure-terraform-azurerm-vnet-e0b9155/variables.tf line 39, in variable "nsg_ids":
  39:   type        = "map"

Terraform 0.11 and earlier required type constraints to be given in quotes,
but that form is now deprecated and will be removed in a future version of
Terraform. To silence this warning, remove the quotes around "map" and write
map(string) instead to explicitly indicate that the map elements are strings.

(and one more similar warning elsewhere)

```

</details>

*Workflow: `Terraform validation`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./Oppgave1`*
